# GridCenterSegmentPattern Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridCenterSegmentPattern Property
ParameterTypeId Class See Also
---
"Center Segment Pattern"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridCenterSegmentPattern { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridCenterSegmentPattern As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridCenterSegmentPattern {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace